app/Controllers/Tarefas.php

SELECT *
FROM `tarefas`
---
    public function index()
    {
        $data['tarefas'] = $this->tarefaModel->findAll();

SELECT *
FROM `tarefas`
WHERE `tarefas`.`id` = '1'
---
    public function edit($id = null)
    {
        $data['tarefa'] = $this->tarefaModel->find($id);

SELECT *
FROM `tarefas`
ORDER BY `data_programada` ASC
---
    public function cronograma()
    {
        $data['tarefas'] = $this->tarefaModel->orderBy('data_programada', 'ASC')->findAll();